Revit 2027 API
TransmissionData.UserData Property
 A string which users can store notes in.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string UserData { get; set; }
Public Property UserData As String
	Get
	Set
public:
property String^ UserData {
	String^ get ();
	void set (String^ value);
}
member UserData : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
TransmissionData Class
Autodesk.Revit.DB Namespace